In [2]:
from env import config, BASE_DIR
from sqlalchemy import create_engine, text

In [3]:
DATABASE_URL = config("HOUSING_DATABASE_URL", cast=str, default=None)
DATABASE_URL is not None

True

In [4]:
engine = create_engine(str(DATABASE_URL))

In [5]:
DATASET_DIR = BASE_DIR / "datasets"
DATASET_DIR.exists()

True

In [6]:
HOUSE_CSV = DATASET_DIR / "housing_ds.csv"
HOUSE_CSV.exists()

True

In [7]:
import pandas as pd

In [8]:
df = pd.read_csv(HOUSE_CSV)
df.head(n=15)

      saledate      MA   type  bedrooms
0   30/09/2007  441854  house         2
1   31/12/2007  441854  house         2
2   31/03/2008  441854  house         2
3   30/06/2008  441854  house         2
4   30/09/2008  451583  house         2
5   31/12/2008  440256  house         2
6   31/03/2009  442566  house         2
7   30/06/2009  446113  house         2
8   30/09/2009  440123  house         2
9   31/12/2009  442131  house         2
10  31/03/2010  459222  house         2
11  30/06/2010  456822  house         2
12  30/09/2010  457806  house         2
13  31/12/2010  459109  house         2
14  31/03/2011  460758  house         2

In [16]:
df.dtypes

saledate    object
MA           int64
type        object
bedrooms     int64
dtype: object

In [17]:
df['date']=pd.to_datetime(df['saledate'], format="%d/%m/%Y")

In [18]:
df.dtypes

saledate            object
MA                   int64
type                object
bedrooms             int64
date        datetime64[ns]
dtype: object

In [24]:
out_df = df.copy()[['date', 'MA', 'type', 'bedrooms']]

In [25]:
out_df.to_sql("kaggle_house_data", engine, if_exists='replace', index=False)

347

In [26]:
df.shape

(347, 5)

In [27]:
with engine.connect() as conn:
   results = conn.execute(text(f"SELECT * from kaggle_house_data LIMIT 10"))
   print(results.all())

[(datetime.datetime(2007, 9, 30, 0, 0), 441854, 'house', 2), (datetime.datetime(2007, 12, 31, 0, 0), 441854, 'house', 2), (datetime.datetime(2008, 3, 31, 0, 0), 441854, 'house', 2), (datetime.datetime(2008, 6, 30, 0, 0), 441854, 'house', 2), (datetime.datetime(2008, 9, 30, 0, 0), 451583, 'house', 2), (datetime.datetime(2008, 12, 31, 0, 0), 440256, 'house', 2), (datetime.datetime(2009, 3, 31, 0, 0), 442566, 'house', 2), (datetime.datetime(2009, 6, 30, 0, 0), 446113, 'house', 2), (datetime.datetime(2009, 9, 30, 0, 0), 440123, 'house', 2), (datetime.datetime(2009, 12, 31, 0, 0), 442131, 'house', 2)]